#
# さざまざな形のタートルをだす
#
from turtle import *
# hide default turtle
ht()
# 兎の形　　（x、y）座標で構成されるタプルで輪郭を定義
# rabbit shape data
rdata = ((0, 16), (-2, 14), (-3, 11), (-3, 6), (-2, 5), (-2, 7),
         (-1, 10),(-2, 7), (-2, 5), (-3, 6), (-3, 10), (-4, 13),
         (-5, 13), (-4, 2), (-5, -10), (-4, -10), (-3, -4),
         (0, -5), (3, -4), (4, -10), (5, -10), (4, 2), (5, 13),
         (4, 13), (3, 10), (3, 6), (2, 5), (2, 7), (1, 10),
         (2, 7), (2, 5), (3, 6), (3, 11), (2, 14))
# "rabbbit" という名称で登録
getscreen().register_shape("rabbit", rdata)
# トランプのスーツの形を定義
d = ((0, 16), (10, 0), (0, -16), (-10, 0), (0, 16))
h = ((0, 6), (2, 8), (4, 9), (8, 9), (10, 8), (12, 6), (13, 4),
     (13, 0), (12, -2), (11, -3), (0, -16), (-11, -3), (-12, -2),
     (-13, 0), (-13, 4), (-12, 6), (-10, 8), (-8, 9), (-4, 9),
     (-2, 8), (0, 6))
s = ((0, 16), (10, 4), (12, 2), (13, -2), (12, -6), (10, -8),
      (8, -9), (4, -9), (1, -8), (3, -16), (0, -16), (-3, -16),
      (-1, -8), (-4, -9), (-8, -9), (-10, -8), (-12, -6), (-13, -2),
      (-12, 2), (-10, 4), (0, 16))
c = ((0, 16), (4, 15), (6, 13), (7, 10), (7, 8), (6, 5), (4, 3),
     (1, 2), (1, -2), (2, -2), (3, 1), (5, 3), (7, 4), (11, 4),
     (13, 3), (15, 1), (16, -3), (15, -7), (13, -9), (11, -10),
     (7, -10), (5, -9), (3, -7), (2, -4), (1, -4), (1, -8), (3, -16),
     (0, -16), (-3, -16), (-1, -8), (-1, -4), (-2, -4), (-3, -7),
     (-5, -9), (-7, -10), (-11, -10), (-13, -9), (-15, -7), (-16, -3),
     (-15, 1), (-13, 3), (-11, 4), (-7, 4), (-5, 3), (-3, 1),
     (-2, -2), (-1, -2), (-1, 2), (-4, 3), (-6, 5), (-7, 10),
     (-6, 13), (-4, 15), (0, 16))
# "dia", "heart", "spade", "clover" という名称で登録
getscreen(),register_shape("dia", d)
getscreen(),register_shape("heart", h)
getscreen(),register_shape("spade", s)
getscreen(),register_shape("clover", c)
#
# 生成するタートルの形、　輪郭の色、　塗りつぶす色のリスト
#
# shapes の1行目、　6種類は標準で使える形
shapes = ["arrow", "turtle", "circle", "square", "triangle", "classic",
          "rabbit", "dia", "spade", "heart", "clover"]
colors = ["black", "green", "black", "black", "black", "black",
          "red", "red", "black", "red", "black"]
colors_fill = ["white", "white", "white", "white", "white", "white",
               "white", "red", "black", "red", "black"]
#
# タートルのリスト　ttls にTurtle()でタートルを生成、形と色を指定の
# のち、少し歩かせる
ttls = []
for i in range(len(shapes)):
  ttls.append(Turtle())
  ttls[i].shape(shapes[i])
  ttls[i].up()
  ttls[i].color(colors[i], colors_fill[i])
  for j in range(i*3):
    ttls[i].fd(20)
    ttls[i].left(10)
#
# 全員で一周
#
for i in range(36):
  for i in range(len(shapes)):
    ttls[i].fd(20)
    ttls[i].left(10)
  